---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape
source: html/8130cd51-a81f-c359-9fd4-789590b07034.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape

General shapes for structural sections.

## Syntax (C#)
```csharp
public enum StructuralSectionGeneralShape
```